jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324x9i_eval_ioe16-1.c
/**
  ******************************************************************************
  * @file    stm324x9i_eval_ioe16.c
  * @author  MCD Application Team
  * @version V0.1.0
  * @date    07-December-2012
  * @brief   This file provides a set of functions needed to manage the STMPE1600
  *          IO Expander devices mounted on STM324x9I-EVAL evaluation board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

  /* File Info : ---------------------------------------------------------------
  
    Note:
    -----
    - This driver doesn't use the DMA method for sending and receiving data on I2C 
      bus. It uses a direct I2C communication.  
  
    SUPPORTED FEATURES:
      - IO Read/write : Set/Reset and Read (Polling/Interrupt)
      - Joystick: config and Read (Polling/Interrupt)

    UNSUPPORTED FEATURES:
      - Row ADC Feature is not supported (not implemented on STM324x9I_EVAL board)
      - Touch Screen Features: Single point mode (Polling/Interrupt)
      - TempSensor Feature: accuracy not determined (Polling)
  ----------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "stm324x9i_eval_ioe16.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM324x9I_EVAL
  * @{
  */
    
/** @defgroup STM324x9I_EVAL_IOE16 
  * @brief  This file includes the IO Expander driver for STMPE1600 IO Expander 
  *         devices.
  * @{
  */ 
  

/** @defgroup STM324x9I_EVAL_IOE16_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE16_Private_Defines
  * @{
  */ 
#define TIMEOUT_MAX    0x10000 /*<! The value of the maximal timeout for I2C waiting loops */
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE16_Private_Macros
  * @{
  */ 
/**
  * @}
  */ 

/** @defgroup STM324x9I_EVAL_IOE16_Private_Variables
  * @{
  */ 

uint32_t IOE16_TimeOut = TIMEOUT_MAX; /*<! Value of Timeout when I2C communication fails */
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE16_Private_FunctionPrototypes
  * @{
  */ 

 void IOE16_GPIO_Config(void);
 void IOE16_I2C_Config(void);
 void IOE16_EXTI_Config(void);

#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE16_Private_Functions
  * @{
  */ 


/**
  * @brief  Initializes and Configures the IO_Expander Functionalities and 
  *         configures all STM324x9I_EVAL necessary hardware (GPIOs, APB clocks..).
  * @param  None
  * @retval IOE16_OK if all initializations done correctly. Other value if error.
  */
uint8_t IOE16_Config(void)
{
  /* Configure the needed pins */
  IOE16_GPIO_Config(); 
  
  /* I2C initialization */
  IOE16_I2C_Config(); 
  
  /* Read IO Expander ID  */
  if(IOE16_IsOperational())
  {
    return IOE16_NOT_OPERATIONAL;
  }
  
  /* Generate IOExpander Software reset */
  IOE16_Reset();  
  
  /* Configuration is OK */
  return IOE16_OK; 
}

/**
  * @brief  Configures The selected IOs in interrupt mode.
  * @param  IOE16_ITSRC_Source: the source of the interrupts. Could be one or a 
  *         combination of IT pins.
  * @retval IOE16_OK: if configuration is OK. Other value if error.
  */
uint8_t IOE16_ITConfig(uint32_t IOE16_ITSRC_Source)
{   
	
  /* Configure the Interrupt output pin to generate low level */
  IOE16_ITOutConfig(IOE16_Polarity_Low);     
   
  /* Enable the Global interrupt */  
  IOE16_GITCmd(ENABLE);  

  /* Put IO pins in input mode */
  IOE16_IOPinConfig(IOE16_ITSRC_Source, Direction_IN);
	
  /* Read the GPIO interrupt status to clear all pending bits if any */
  IOE16_I2C_ReadDeviceRegister(IOE16_REG_ISGPIOR_LSB);  	
  

  /* Enable the pins to generate interrupt */
  IOE16_IOITConfig(IOE16_ITSRC_Source, ENABLE);
	
	// clear interrupt status - INT_STA_LOW(0x0A), Io_Expander's INT pin output also cleared
	IOE16_I2C_ReadDeviceRegister(0x0A );	 

	/* Read IOs state to let IO interrupt occur */
  IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPMR_LSB);
  IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPMR_MSB);
	
 	/* Configure the Interrupt line as EXTI source */
  //phv 2102IOE16_EXTI_Config(); 
	
  /* If all OK return IOE16_OK */
  return IOE16_OK;
}

/**
  * @brief  Sets a bit value to an output IO pin.
  * @param IO_Pin: The output pin to be set or reset. This parameter could be any
  *         combination of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 15. 
  * @param NewState: The value to be set. This parameter can be one of the
  *        following values: BitSet or BitReset. See IOE16_BitVal_TypeDef.
  * @retval IOE16_OK or PARAM_ERROR
  */
uint8_t IOE16_SetIOPin(uint16_t IO_Pin, IOE16_BitValue_TypeDef NewState)
{
  uint16_t tmp = 0;
  
  /* Get the IO expander Address according to which pin is to be controlled */
  if ((IO_Pin & IO16_Pin_ALL_LSB) != 0)
  {
    tmp = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPMR_LSB);
    /* Apply the bit value to the selected pin */
    if (NewState == IOE16_BitReset)
    {
      tmp &= ~ (uint16_t)IO_Pin;
    }
    else
    {
      tmp |= (uint16_t)IO_Pin;
    }
    /* Set register value */
    IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPSR_LSB, (uint8_t)tmp);
  }
  else if((IO_Pin & IO16_Pin_ALL_MSB) != 0)
  {
    tmp = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPMR_MSB);
    /* Apply the bit value to the selected pin */
    if (NewState == IOE16_BitReset)
    {
      tmp &= ~ (uint16_t)IO_Pin;
    }
    else
    {
      tmp |= (uint16_t)IO_Pin;
    }
    /* Set register value */
    IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPSR_MSB, (uint8_t)(uint8_t)(tmp >> 8));
      
