jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324x9i_eval_ioe16-1.c
  }
  else
  {
    return IOE16_PARAM_ERROR;
  }
  
  return IOE16_OK;
}


/**
  * @brief  Monitors the status of the selected input IO pin.
  * @param IO_Pin: The input pin to be read. This parameter could be any
  *                of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 15. 
  * @retval Status of the selected input IO pin. Could be BitSet or BitReset.
  */
uint8_t IOE16_MonitorIOPin(uint16_t IO_Pin, uint8_t RegisterAddr)
{
  uint8_t tmp = 0;
  
  if(IO_Pin & IO16_Pin_ALL_LSB)
  {
    /* Get all the Pins status */
    tmp = IOE16_I2C_ReadDeviceRegister(RegisterAddr);
    if ((tmp & (uint8_t)(IO_Pin & IO16_Pin_ALL_LSB)) != 0)
    {
      return IOE16_BitSet;
    }  
    else 
    {
      return IOE16_BitReset;
    }
  }
  else if(IO_Pin & IO16_Pin_ALL_MSB)
  {
    /* Get all the Pins status */
    tmp = IOE16_I2C_ReadDeviceRegister(RegisterAddr);
    if ((tmp & (uint8_t)((IO_Pin & IO16_Pin_ALL_MSB)>>8)) != 0)
    {
      return IOE16_BitSet;
    }  
    else 
    {
      return IOE16_BitReset;
    } 
  }
  else
  {
     return IOE16_PARAM_ERROR;
  }
  
}

/**
  * @brief  Enable or disables polarity inversion of the selected IO pins.
  * @param IO_Pin: The input pin to be read. This parameter could be any
  *                of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 15.
  * @param NewState: The value to be set. This parameter can be one of the
  *        following values: BitSet or BitReset. See IOE16_BitVal_TypeDef.
  * @retval Status of the selected input IO pin. Could be IOE16_BitSet or IOE16_BitReset.
  */
uint8_t IOE16_Polarity_Inversion(uint16_t IO_Pin, IOE16_BitValue_TypeDef NewState)
{
  uint16_t tmp = 0;
  
  /* Get the register value */
  tmp = IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPPIR_LSB);
  tmp |= (((uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPPIR_MSB))<<8);

  /* Apply the bit value to the selected pin */
  if (NewState == IOE16_BitReset)
  {
    tmp &= ~ (uint16_t)IO_Pin;
  }
  else
  {
    tmp |= (uint16_t)IO_Pin;
  }
    
  /* Set register value */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPPIR_LSB, (uint8_t)tmp); 
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPPIR_MSB, (uint8_t)(tmp >> 8)); 
  
  return IOE16_OK;
  
}

/**
  * @brief  Returns the current Joystick status.
  * @param  None
  * @retval The code of the Joystick key pressed: 
  *   @arg  JOY_NONE
  *   @arg  JOY_SEL
  *   @arg  JOY_DOWN
  *   @arg  JOY_LEFT
  *   @arg  JOY_RIGHT
  *   @arg  JOY_UP
  */
JOYState_TypeDef IOE16_JoyStickGetState(void)
{
  __IO uint8_t tmp = 0;
  
  /* Read the status of all pins */
  tmp = IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPMR_MSB);
  tmp = ~(tmp & (uint8_t)(JOY_IO16_PINS>>8));
  
  /* Check the pressed keys */
  if ((tmp & (uint8_t)(JOY_IO16_NONE>>8)) == JOY_NONE)
  {
    return (JOYState_TypeDef) JOY_NONE;
  }
  else if (tmp & (uint8_t)(JOY_IO16_SEL>>8))
  {
    return (JOYState_TypeDef) JOY_SEL;
  }
  else if (tmp & (uint8_t)(JOY_IO16_DOWN>>8))
  {
    return (JOYState_TypeDef) JOY_DOWN;
  }
  else if (tmp & (uint8_t)(JOY_IO16_LEFT>>8))
  {
    return (JOYState_TypeDef) JOY_LEFT;
  }
  else if (tmp & (uint8_t)(JOY_IO16_RIGHT>>8))
  {
    return (JOYState_TypeDef) JOY_RIGHT;
  }
  else if (tmp & (uint8_t)(JOY_IO16_UP>>8))
  {
    return (JOYState_TypeDef) JOY_UP;
  }
  else
  { 
    return (JOYState_TypeDef) JOY_NONE;
  }
}

/**
  * @brief  Gets the IT status register value and clears all the pending bits.            
  * @retval Status register value.
  */
uint16_t IOE16_GetITStatus(void)
{
  uint16_t tmpsr, tmpsr2 = 0;
  
  /* Gets the IT status register value */
  tmpsr = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_ISGPIOR_LSB);
  tmpsr2 = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_ISGPIOR_MSB);
  tmpsr2 = (tmpsr2 << 8);
  
  /* returns the status register value */
  return (tmpsr | tmpsr2);
}


/**
  * @brief  Checks if the device is correctly configured and communicates correctly 
  *         on the I2C bus.
  * @param  None.          
  * @retval IOE16_OK if IOE is operational. Other value if failure.
  */
uint8_t IOE16_IsOperational(void)
{
  /* Return Error if the ID is not correct */
  if( IOE16_ReadID() != (uint16_t)STMPE1600_ID )
  {
    /* Check if a Timeout occurred */
    if (IOE16_TimeOut == 0)
    {
      return(IOE16_TimeoutUserCallback());
    }
    else
    {
      return IOE16_FAILURE; /* ID is not Correct */
    }
  } 
  else 
  {
    return IOE16_OK; /* ID is correct */
  }
}

/**
  * @brief  Resets the IO Expander by Software (SYS_CTRL, RESET bit).
  * @param  None.
  * @retval IOE16_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE16_Reset(void)
{
  /* Power Down the IO_Expander */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_SYS_CTRL, 0x80);

  /* wait for a delay to ensure registers erasing */
  _delay_(2); 
  
  /* Power On the Codec after the power off => all registers are reinitialized*/
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_SYS_CTRL, 0x00);
  
  /* If all OK return IOE16_OK */
  return IOE16_OK;    
}

/**
  * @brief  Reads the IO Expander device's ID.
  * @param  None.
  * @retval The Device ID (two bytes).
  */
uint16_t IOE16_ReadID(void)
{
  uint16_t tmp = 0;

  /* Read the device ID  */
  tmp = IOE16_I2C_ReadDeviceRegister(1);
  tmp = (uint32_t)(tmp << 8);
  tmp |= (uint32_t)IOE16_I2C_ReadDeviceRegister(0);
  
  /* Return the ID */
  return (uint16_t)tmp;
}

/**
  * @brief  Configures the Interrupt line Polarity
  * @param  Polarity: could be one of these values; 
  *   @arg  Polarity_Low: Interrupt line is active Low/Falling edge      
  *   @arg  Polarity_High: Interrupt line is active High/Rising edge               
  * @retval IOE16_OK: if configuration is OK. Other value if error.
  */
uint8_t IOE16_ITOutConfig(uint8_t Polarity)
{
  uint8_t tmp = 0;
  
  /*  Get the register IOE16_REG_INT_CTRL value */ 
  tmp = IOE16_I2C_ReadDeviceRegister(IOE16_REG_SYS_CTRL);
  
  /* Mask the polarity bit */
  tmp &= ~(uint8_t)0x01;
    
  /* Modify the Interrupt Output line configuration */
  tmp |= (uint8_t)Polarity;
  
  /* Set the register */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_SYS_CTRL, tmp);
  
  /* If all OK return IOE16_OK */
  return IOE16_OK;  
}

/**
  * @brief  Configures the selected pin direction (to be an input or an output)    
  * @param  IO_Pin: This parameter could be any combination of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 15.  
  * @param  Direction: could be Direction_IN or Direction_OUT.      
  * @retval IOE16_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE16_IOPinConfig(uint16_t IO_Pin, uint8_t Direction)
{
  uint16_t tmp = 0; 
    
  /* Get all the Pins direction */
  tmp = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPDR_LSB);
  tmp |= ((uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_GPDR_MSB)>>8); 
  
