jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324x9i_eval_ioe16-1.c
  if (Direction != Direction_IN)
  {
    tmp |= (uint16_t)IO_Pin;
  }  
  else 
  {
    tmp &= ~(uint16_t)IO_Pin;
  }
    
  /* Write the registers new values */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPDR_LSB, (uint8_t)(tmp & IO16_Pin_ALL_LSB));
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_GPDR_MSB, (uint8_t)((tmp & IO16_Pin_ALL_LSB)>>8));
  
  /* If all OK return IOE16_OK */
  return IOE16_OK;      
}

/**
  * @brief  Enables or disables the Global interrupt.
  * @param  NewState: could be ENABLE or DISABLE.        
  * @retval IOE16_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE16_GITCmd(FunctionalState NewState)
{
  uint8_t tmp = 0;
  
  /* Read the Interrupt Control register  */
  tmp = IOE16_I2C_ReadDeviceRegister(IOE16_REG_SYS_CTRL);
  
  if (NewState != DISABLE)
  {
    /* Set the global interrupts to be Enabled */    
    tmp |= (uint8_t)IOE16_IT_EN;
  }
  else
  {
    /* Set the global interrupts to be Disabled */    
    tmp &= ~(uint8_t)IOE16_IT_EN;
  }  
  
  /* Write Back the Interrupt Control register */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_SYS_CTRL, tmp);

  /* If all OK return IOE16_OK */
  return IOE16_OK;     
}

/**
  * @brief  Configures the selected pins to generate an interrupt or not.
  * @param  IO_IT: The IO interrupt to be configured. This parameter could be any
  *         combination of the following values:
  *   @arg  IO_IT_x: where x can be from 0 to 15.
  * @param  NewState: could be ENABLE or DISABLE.  
  * @retval IOE16_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE16_IOITConfig(uint16_t IO_IT, FunctionalState NewState)
{
  uint16_t tmp = 0;
 
  tmp = (uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_IEGPIOR_LSB);
  tmp |= ((uint16_t)IOE16_I2C_ReadDeviceRegister(IOE16_REG_IEGPIOR_MSB)>>8);
  
  if (NewState != DISABLE)
  {
    /* Set the interrupts to be Enabled */    
    tmp |= (uint16_t)IO_IT;
  }
  else
  {
    /* Set the interrupts to be Disabled */    
    tmp &= ~(uint16_t)IO_IT;
  }
  
  /* Set the registers */
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_IEGPIOR_LSB, (uint8_t)(tmp & ALL_IT_LSB));
  IOE16_I2C_WriteDeviceRegister(IOE16_REG_IEGPIOR_MSB, (uint8_t)((tmp & ALL_IT_MSB)>>8));
  
  /* If all OK return IOE16_OK */
  return IOE16_OK;   
}

/**
  * @brief  Writes a value in a register of the device through I2C without DMA.
  * @param  RegisterAddr: The target register address
  * @param  RegisterValue: The target register value to be written 
  * @retval IOE16_OK: if all operations are OK. Other value if error.
  */
uint8_t IOE16_I2C_WriteDeviceRegister(uint8_t RegisterAddr, uint8_t RegisterValue)
{
  uint32_t read_verif = 0;

  /* Begin the config sequence */
  I2C_GenerateSTART(IOE16_I2C, ENABLE);

  /* Test on EV5 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_SB))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }

  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(IOE16_I2C, IOE16_ADDR, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;  
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_ADDR))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Read status register 2 to clear ADDR flag */
  IOE16_I2C->SR2;
  
  /* Test on EV8_1 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Transmit the first address for r/w operations */
  I2C_SendData(IOE16_I2C, RegisterAddr);
  
  /* Test on EV8 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Prepare the register value to be sent */
  I2C_SendData(IOE16_I2C, RegisterValue);
  
  /* Test on EV8_2 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while ((!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_BTF)))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* End the configuration sequence */
  I2C_GenerateSTOP(IOE16_I2C, ENABLE);
    

#ifdef VERIFY_WRITTENDATA
  /* Verify (if needed) that the loaded data is correct  */
  
  /* Read the just written register*/
  read_verif = IOE16_I2C_ReadDeviceRegister(RegisterAddr);

  /* Load the register and verify its value  */
  if (read_verif != RegisterValue)
  {
    /* Control data wrongly transferred */
    read_verif = IOE16_FAILURE;
  }
  else
  {
    /* Control data correctly transferred */
    read_verif = 0;
  }
#endif
  
  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
  return read_verif;
}


/**
  * @brief  Reads a register of the device through I2C without DMA.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval The value of the read register (0xAA if Timeout occurred)   
  */ 
uint8_t IOE16_I2C_ReadDeviceRegister(uint8_t RegisterAddr)
{
  uint8_t tmp = 0;
  
  /* Enable the I2C peripheral */
  I2C_GenerateSTART(IOE16_I2C, ENABLE);
 
  /* Test on EV5 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_SB))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  /* Disable Acknowledgement */
  I2C_AcknowledgeConfig(IOE16_I2C, DISABLE);
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(IOE16_I2C, IOE16_ADDR, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;  
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_ADDR))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Read status register 2 to clear ADDR flag */
  IOE16_I2C->SR2;
  
  /* Test on EV8 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Transmit the first address for r/w operations */
  I2C_SendData(IOE16_I2C, RegisterAddr);
  
  /* Test on EV8 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while ((!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_BTF)))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Regenerate a start condition */
  I2C_GenerateSTART(IOE16_I2C, ENABLE);
  
