jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324x9i_eval_ioe16-1.c
  /* Test on EV5 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_SB))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(IOE16_I2C, IOE16_ADDR, I2C_Direction_Receiver);
  
  /* Test on EV6 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_ADDR))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
    /* Read status register 2 to clear ADDR flag */
  IOE16_I2C->SR2;
  
  /* Test on EV7 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_RXNE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* End the configuration sequence */
  I2C_GenerateSTOP(IOE16_I2C, ENABLE);

  /* Load the register value */
  tmp = I2C_ReceiveData(IOE16_I2C);
  
  /* Enable Acknowledgement */
  I2C_AcknowledgeConfig(IOE16_I2C, ENABLE);
  
  /* Return the read value */
  return tmp;

}

/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval A pointer to the buffer containing the two returned bytes (in halfword).  
  */
uint16_t IOE16_I2C_ReadDataBuffer(uint32_t RegisterAddr)
{
  uint8_t Buffer[2] = {0x00, 0x00};  
 
  /* Enable the I2C peripheral */
  I2C_GenerateSTART(IOE16_I2C, ENABLE);
  
  /* Test on EV5 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_SB))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
   
  /* Send device address for write */
  I2C_Send7bitAddress(IOE16_I2C, IOE16_ADDR, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;  
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_ADDR))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Read status register 2 to clear ADDR flag */
  IOE16_I2C->SR2;
  
  /* Test on EV8 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_TXE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Send the device's internal address to write to */
  I2C_SendData(IOE16_I2C, RegisterAddr);  
    
  /* Send START condition a second time */  
  I2C_GenerateSTART(IOE16_I2C, ENABLE);
  
  /* Test on EV5 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_SB))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Send IO Expander address for read */
  I2C_Send7bitAddress(IOE16_I2C, IOE16_ADDR, I2C_Direction_Receiver);
  
  /* Test on EV6 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_ADDR))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }

  /* Read status register 2 to clear ADDR flag */
  IOE16_I2C->SR2;
  
  /* Test on EV7 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_RXNE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
    
  /* Read the first byte from the IO Expander */
  Buffer[1] = I2C_ReceiveData(IOE16_I2C);

  /* Disable Acknowledgement */
  I2C_AcknowledgeConfig(IOE16_I2C, DISABLE);
      
  /* Send STOP Condition */
  I2C_GenerateSTOP(IOE16_I2C, ENABLE);

  /* Test on EV7 and clear it */
  IOE16_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE16_I2C, I2C_FLAG_RXNE))
  {
    if (IOE16_TimeOut-- == 0) return(IOE16_TimeoutUserCallback());
  }
  
  /* Read the second byte from the IO Expander */
  Buffer[0] = I2C_ReceiveData(IOE16_I2C);
 
  /* Enable Acknowledgement to be ready for another reception */
  I2C_AcknowledgeConfig(IOE16_I2C, ENABLE);
  
  /* return a pointer to the buffer */
  return *(uint16_t *)Buffer;

}

/**
  * @brief  Initializes the GPIO pins used by the IO expander.
  * @param  None
  * @retval None
  */
void IOE16_GPIO_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable I2C, I2C GPIO_PORT & Alternate Function clocks */
  RCC_APB1PeriphClockCmd(IOE16_I2C_CLK, ENABLE);
  RCC_AHB1PeriphClockCmd(IOE16_I2C_SCL_GPIO_CLK | IOE16_I2C_SDA_GPIO_CLK |
                         IOE16_IT_GPIO_CLK, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
  
  /* Reset I2C */
  RCC_APB1PeriphResetCmd(IOE16_I2C_CLK, ENABLE);
  
  /* Release reset signal of I2C */
  RCC_APB1PeriphResetCmd(IOE16_I2C_CLK, DISABLE);

  /* Connect PXx to I2C_SCL*/
  GPIO_PinAFConfig(IOE16_I2C_SCL_GPIO_PORT, IOE16_I2C_SCL_SOURCE, IOE16_I2C_SCL_AF);
  
  /* Connect PXx to I2C_SDA*/
  GPIO_PinAFConfig(IOE16_I2C_SDA_GPIO_PORT, IOE16_I2C_SDA_SOURCE, IOE16_I2C_SDA_AF); 
    
  /* I2C SCL and SDA pins configuration */
  GPIO_InitStructure.GPIO_Pin = IOE16_I2C_SCL_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(IOE16_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = IOE16_I2C_SDA_PIN;
  GPIO_Init(IOE16_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
 
}

/**
  * @brief  Configure the I2C Peripheral used to communicate with IO_Expanders.
  * @param  None
  * @retval None
  */
void IOE16_I2C_Config(void)
{
  I2C_InitTypeDef I2C_InitStructure;
  
  /* IOE16_I2C configuration */
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x00;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
  
  I2C_Init(IOE16_I2C, &I2C_InitStructure);
}


/**
  * @brief  Configures the IO expander Interrupt line and GPIO in EXTI mode.
  * @param  None        
  * @retval None
  */
void IOE16_EXTI_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
 
