jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324x9i_eval_ioe16-1.c
  /* Enable GPIO clock */
  RCC_AHB1PeriphClockCmd(IOE16_IT_GPIO_CLK, ENABLE);
  
  /* Enable SYSCFG clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure Button pin as input floating */
  GPIO_InitStructure.GPIO_Pin = IOE16_IT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(IOE16_IT_GPIO_PORT, &GPIO_InitStructure);  
  
  /* Connect TS + JoyStick EXTI Line to  GPIO Pin */
  SYSCFG_EXTILineConfig(IOE16_IT_EXTI_PORT_SOURCE, IOE16_IT_EXTI_PIN_SOURCE);  
  
  /* Configure TS + JoyStick EXTI line */
  EXTI_InitStructure.EXTI_Line = IOE16_IT_EXTI_LINE;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; //EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
  
  /* Enable and set Button EXTI Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = IOE16_IT_EXTI_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

#ifndef USE_TIMEOUT_USER_CALLBACK 
/**
  * @brief  IOE16_TIMEOUT_UserCallback
  * @param  None
  * @retval 0
  */
uint8_t IOE16_TimeoutUserCallback(void)
{
  I2C_InitTypeDef I2C_InitStructure;

  I2C_GenerateSTOP(IOE16_I2C, ENABLE);
  I2C_SoftwareResetCmd(IOE16_I2C, ENABLE);
  I2C_SoftwareResetCmd(IOE16_I2C, DISABLE);
  
  IOE16_GPIO_Config();

  /* CODEC_I2C peripheral configuration */
  I2C_DeInit(IOE16_I2C);
  
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x0;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
  
  /* Enable the I2C peripheral */
  I2C_Cmd(IOE16_I2C, ENABLE);  
  I2C_Init(IOE16_I2C, &I2C_InitStructure);
  
  return 0;
  
}
#endif /* !USE_TIMEOUT_USER_CALLBACK */

#ifndef USE_Delay
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0; 
  for(index = (100000 * nCount); index != 0; index--)
  {
  }
}
#endif /* USE_Delay*/
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */      
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
